{"id":650827,"date":"2024-06-28T14:33:15","date_gmt":"2024-06-28T12:33:15","guid":{"rendered":"https:\/\/airdrops.io\/?p=650827"},"modified":"2024-07-01T16:04:49","modified_gmt":"2024-07-01T14:04:49","slug":"650827-2","status":"publish","type":"post","link":"https:\/\/airdrops.io\/a-farmers-reflection-on-the-zk-airdrop\/","title":{"rendered":"A Farmer&#8217;s Reflection on the ZK Airdrop"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">ZkSync was the most highly anticipated airdrop in recent years and one of the most generous, distributing 17.5% of the total supply to eligible users and builders. While over 6 million wallets interacted with zkSync’s Layer 2, just over <\/span><a href=\"https:\/\/blog.zknation.io\/zk-token\/\"><span style=\"font-weight: 400;\">695,000 wallets were included<\/span><\/a><span style=\"font-weight: 400;\">. Despite many missing out, ZK is one of the most widely distributed airdrops. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s not over for ZK farmers though. A further 49.5% of the supply will go to the community. In an upcoming post we’ll outline how to position for these further drops. In this post, we’ll take a look at 5 lessons from the ZK airdrop to see what farmers can learn from this event and how they can apply these takeaways to other Layer 2’s that are yet to <\/span><span style=\"font-weight: 400;\">tokenize<\/span><span style=\"font-weight: 400;\">. <\/span><\/p>\n<h2><b>Lesson #1: Bridge In and Bridge Often, But Don’t Bridge Out<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">ZK took a serious departure from the playbook of other Layer 2 airdrops, such as Arbitrum. Transaction volume was not a qualifier at all! What they did introduce however, which we haven’t really seen much of in airdrops up until now, is a multiplier based on your time-weighted average balance (TWAB). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A TWAB approach favours smaller farmers who have less funds as compared to previous airdrops. It opens up the possibility that users with smaller pockets can maintain a larger TWAB than a mercenary farmer with more capital who only parked funds on zkSync for a much shorter time period. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Specifically, zkSync users needed a time-weighted average balance of $50 to qualify, with a larger TWAB boosting to their allocation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The few lessons farmers should take from this: <\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400;\">Users who stick around are rewarded: When bridging funds to a Layer 2, try to keep your funds there for as long as possible.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">It’s a marathon, not a sprint: Bridge an initial amount and then bridge more funds over time. <\/span><\/li>\n<li>Actively participate in DeFi protocols: Deposit these funds into a DeFi liquidity pool to earn yield and increase your chances of qualifying.<\/li>\n<\/ol>\n<h2><b>Lesson #2: HODL native tokens and NFTs<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Always buy and HOLD native tokens and NFTs for the Layer 2s you’re farming. You can use <\/span><a href=\"https:\/\/defillama.com\/\"><span style=\"font-weight: 400;\">DeFiLlama<\/span><\/a><span style=\"font-weight: 400;\"> to see the top protocols for the chain you’re farming and see if they have a token. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">ZkSync users who held $50 or more in native tokens received a multiplier, specifically the top 7 projects ranked by market capitalisation. Another multiplier was given if a ZkSync native NFT collection was held at snapshot. On top of both of these actions, you should also trade at least 10 different ERC-20 tokens on the L2s you’re farming, as this was an eligibility criteria for ZK. <\/span><\/p>\n<h2><b>Lesson #3: Turn on Notifications on X for the Project You’re Farming<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">As well as DeFiLlama, you can also turn on notifications for the official account of a Layer 2 on X to see what they post about. They’ll often promote native tokens and NFT collections. It’s recommended to take action based on what a project tweets about, as these can be subtle hints of which on-chain activities may be rewarded with an airdrop.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, the <\/span><a href=\"https:\/\/x.com\/search?q=paymaster%20(from%3Azksync)&amp;src=typed_query\"><span style=\"font-weight: 400;\">official zkSync account<\/span><\/a><span style=\"font-weight: 400;\"> on X frequently tweeted about Paymaster function, which allows you to pay gas fees with tokens other than ETH. Many airdrop farmers speculated that using Paymaster frequently would be a possible criteria or multiplier, and they turned out to be right! <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Similarly, you want to see what the official account of a Layer 2 is promoting and act on these cues to bag a larger airdrop!<\/span><\/p>\n<h2><b>Lesson #4: Be active on-chain and try new things<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">A total of 102.375 million ZK tokens were distributed to experimental, on-chain communities, highlighting the importance of being active on-chain and trying new things. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">BONSAI and DEGEN claimers both got a ZK allocation for simply being early to innovative on-chain communities. BONSAI was airdropped to certain Lens ecosystem users, a web3 social media alternative to Twitter and YouTube. DEGEN is the unofficial coin of Farcaster, another decentralized social media platform which awarded early adopters. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It&#8217;s difficult to be early in the next big thing! But you should always be on the lookout, be active on-chain and try new things to maximise your airdrop exposure. You never know what interactions may end up giving you an unexpected surprise later down the line. <\/span><\/p>\n<h2><b>Lesson #5: Attend Crypto Events and Acquire POAPs<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Did you know that some people receive ZK tokens without being active on-chain? If you had attended one of seven events where zkSync was giving away POAPs, then you could have gotten a higher allocation. POAPs are short for proof of attendance protocols and they are on-chain badges proving you were at an event. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if you had visited ZkSync’s booth at ETH Denver and collected the POAP, you’d have been eligible for the builders allocation. Some of these events even happened after the snapshot. For example, addresses that held POAPs from smaller events, like the zkSync meetup in Brussels, were also given a token allocation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The takeaway from this is that you should look to attend upcoming events, such as <\/span><a href=\"https:\/\/ethcc.io\/\"><span style=\"font-weight: 400;\">EthCC<\/span><\/a><span style=\"font-weight: 400;\"> in Brussels (July 8th-11th). It&#8217;s likely that many teams from tokenless projects will be present and there will be many POAPs to collect. Alternatively, you can look for events closer to home by using sites like <\/span><a href=\"https:\/\/www.eventbrite.com\/\"><span style=\"font-weight: 400;\">EventBrite<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/www.meetup.com\/\"><span style=\"font-weight: 400;\">Meetup<\/span><\/a><span style=\"font-weight: 400;\"> and also by monitoring a project’s X account. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">ZkSync gives us yet another case study for airdrops, along with Arbitrum and StarkNet, that provides very useful information on what to focus on when farming the upcoming tokens for L2s like <\/span><a href=\"https:\/\/airdrops.io\/scroll\/\"><span style=\"font-weight: 400;\">Scroll<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/airdrops.io\/linea\/\"><span style=\"font-weight: 400;\">Linea<\/span><\/a><span style=\"font-weight: 400;\"> or <\/span><a href=\"https:\/\/airdrops.io\/karak\/\"><span style=\"font-weight: 400;\">Karak<\/span><\/a><span style=\"font-weight: 400;\">. By taking these 5 lessons and applying them to your farming, you should have no problems qualifying for the next big drops! <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>ZkSync was the most highly anticipated airdrop in recent years and one of the most generous, distributing 17.5% of the total supply to eligible users and builders. While over 6 &#8230; <\/p>\n<p class=\"read-more-container\"><a title=\"A Farmer&#8217;s Reflection on the ZK Airdrop\" class=\"read-more button\" href=\"https:\/\/airdrops.io\/a-farmers-reflection-on-the-zk-airdrop\/#more-650827\">Read more<span class=\"screen-reader-text\">A Farmer&#8217;s Reflection on the ZK Airdrop<\/span><\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"generate_page_header":"","footnotes":""},"categories":[30],"tags":[],"class_list":["post-650827","post","type-post","status-publish","format-standard","hentry","category-blog","masonry-post","generate-columns","tablet-grid-50","mobile-grid-100","grid-parent","grid-50"],"acf":[],"_links":{"self":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/posts\/650827"}],"collection":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/comments?post=650827"}],"version-history":[{"count":0,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/posts\/650827\/revisions"}],"wp:attachment":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/media?parent=650827"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/categories?post=650827"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/tags?post=650827"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}