{"id":8221,"date":"2018-05-05T08:36:16","date_gmt":"2018-05-05T06:36:16","guid":{"rendered":"https:\/\/airdrops.io\/?p=8221"},"modified":"2019-04-17T08:29:40","modified_gmt":"2019-04-17T06:29:40","slug":"is-myetherwallet-safe","status":"publish","type":"post","link":"https:\/\/airdrops.io\/is-myetherwallet-safe\/","title":{"rendered":"Is MyEtherWallet Safe?"},"content":{"rendered":"<div class=\"mceTemp\"><\/div>\n<h2>Is MyEtherWallet Secure?<\/h2>\n<p><a href=\"https:\/\/www.myetherwallet.com\/\">MyEtherWallet<\/a> (MEW) is a free and open-source interface for Ethereum and ERC20 tokens that allows users to directly interact<\/p>\n<p>with the Ethereum blockchain with just their web browsers. It among the most popular sites for creating and managing Ethereum wallets, but is it safe??<\/p>\n<p>Recently, MyEtherWallet was hit with an attack that redirected some of its servers to a malicious phishing site in Russia, draining the wallets of unsuspecting victims who used MEW during the hours of the hack. This left many users to question the safety of MyEtherWallet and whether they should continue to use it in the future.<\/p>\n<h2>So, should you continue to use MEW?<\/h2>\n<p>To answer this, we will first explain how MyEtherWallet operates. Creating a MEW account will generate a public key and a private key, neither of which are ever stored on the MyEtherWallet site.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-8274 alignright\" src=\"https:\/\/airdrops.io\/wp-content\/uploads\/2018\/05\/mew-article-image.jpg\" alt=\"\" width=\"514\" height=\"360\" \/><br \/>\nIt is the sole responsibility of the user to back up their keys in a safe and reliable place (offline). The user can then access and send their ETH through hardware wallets (TREZOR, Ledger Nano S) or directly with private keys, mnemonic phrases, or keystore files.<\/p>\n<p>Through an exploit in Amazon’s “Route 53” hosting system, the hackers were able to intercept DNS requests for myetherwallet.com to make their own server appear to be the rightful owner of the address. From there, they were able to redirect traffic to their own “MyEtherWallet” clone site, where victims handed over their private keys and seed phrases thinking that they were on the real MEW site. Fortunately, MyEtherWallet identified the hijacked servers and quickly rectified the issue, and only a few thousand dollars worth of ETH was stolen.<\/p>\n<p>Accessing your wallet with a private key, keystore file, or mnemonic phrase leaves you vulnerable to these kinds of attacks. If you happen to land on a phishing site through no fault of your own, you will unknowingly deliver full control of your account to the hijackers.<\/p>\n<p><strong>The most secure way to access your MEW account, <em>by far<\/em>, is with a hardware wallet.<\/strong> Hardware wallets act as a master key, and feature added layers of security such as code scramblers to ensure that your private keys and phrases are never stolen from you. The codes are shown on the screen of the hardware wallet, rather than on the screen of your computer, so an onlooker will never be able to decipher your combinations. If you were to access a malicious site using a hardware wallet, the worst that a hijacker could do is redirect an outgoing transaction to his own wallet. This would be unfortunate, yes, but it’s a lot better than having your entire balance drained.<\/p>\n<figure id=\"attachment_8278\" aria-describedby=\"caption-attachment-8278\" style=\"width: 676px\" class=\"wp-caption alignleft\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-8278\" src=\"https:\/\/airdrops.io\/wp-content\/uploads\/2018\/05\/MEW-article-trezor.jpg\" alt=\"\" width=\"686\" height=\"360\" \/><figcaption id=\"caption-attachment-8278\" class=\"wp-caption-text\"><em>image via the official trezor.io website<\/em><\/figcaption><\/figure>\n<p>Two hardware wallets that we highly recommend are the TREZOR and Ledger Nano S. They are robust and reliable hardware wallets that have not failed us yet. They allow for easy management and storage of Ethereum and many other coins including Bitcoin, Bitcoin Cash, DASH, ZCASH and more (Yes, you can store your ERC20s on them too)!<\/p>\n<p>In short, MyEtherWallet is still safe to use and will remain one of the most popular ETH management platforms, but it’s important for users to understand the risks of inputting their private keys or passwords into any centralized website. Hackers are getting craftier every day, and there is always the possibility that they will learn to exploit even the most trusted sites such as MyEtherWallet. To have peace of mind that your keys will remain safe, buy yourself a hardware wallet and ditch the keystore files.<\/p>\n<div class=\"link-btn\"><a href=\"https:\/\/airdrops.io\/goto\/trezor\/\">To look at TREZOR hardware wallets, click here<\/a><\/div>\n<div class=\"link-btn\"><a href=\"https:\/\/airdrops.io\/goto\/ledger\/\">To look at Ledger Nano S hardware wallets, click here<\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Is MyEtherWallet Secure? MyEtherWallet (MEW) is a free and open-source interface for Ethereum and ERC20 tokens that allows users to directly interact with the Ethereum blockchain with just their web &#8230; <\/p>\n<p class=\"read-more-container\"><a title=\"Is MyEtherWallet Safe?\" class=\"read-more button\" href=\"https:\/\/airdrops.io\/is-myetherwallet-safe\/#more-8221\">Read more<span class=\"screen-reader-text\">Is MyEtherWallet Safe?<\/span><\/a><\/p>\n","protected":false},"author":8,"featured_media":8280,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"generate_page_header":"","footnotes":""},"categories":[30],"tags":[],"class_list":["post-8221","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","masonry-post","generate-columns","tablet-grid-50","mobile-grid-100","grid-parent","grid-50"],"acf":[],"_links":{"self":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/posts\/8221"}],"collection":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/comments?post=8221"}],"version-history":[{"count":0,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/posts\/8221\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/media\/8280"}],"wp:attachment":[{"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/media?parent=8221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/categories?post=8221"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/airdrops.io\/wp-json\/wp\/v2\/tags?post=8221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}